{
    "bacon": {
      "description": "Le lard, légèrement fumé et croustillant une fois revenu, diffuse ses arômes dans tout le plat. Son gras fondant vient enrober les haricots et les viandes, ajoutant une profondeur savoureuse et une texture irrésistible au cassoulet.",
      "imagePath": "/Images/bacon.png",
      "source": "https://www.academie-du-cassoulet.com/la-recette-du-cassoulet/"
    },
    "canard": {
      "description": "Le confit de cuisse de canard, cuit lentement dans sa propre graisse, est l’âme du cassoulet. Sa chair moelleuse, imprégnée de saveurs rustiques, se mêle harmonieusement aux autres ingrédients pour offrir un goût riche et inimitable.",
      "imagePath": "/Images/canard.png",
      "source": "https://www.ina.fr/ina-eclaire-actu/video/rbf02018020/la-recette-traditionnelle-du-cassoulet"
    },
    "haricot": {
      "description": "Les haricots blancs, souvent de type lingot, absorbent durant des heures les sucs des viandes, des aromates et de la sauce. Fondants en bouche, ils forment la trame onctueuse du cassoulet, tout en étant nourrissants et doux.",
      "imagePath": "/Images/haricot.png",
      "source": "https://www.ladepeche.fr/2025/05/17/entre-castelnaudary-carcassonne-toulouse-qui-detient-la-recette-authentique-du-cassoulet-12695405.php"
    },
    "porcs": {
      "description": "Le porc, qu’il s’agisse d’échine, de jarret ou de poitrine, offre une texture généreuse et une saveur profondément charnue. Sa cuisson lente dans le cassoulet libère un jus savoureux qui imprègne toute la préparation.",
      "imagePath": "/Images/porcs.png"
    },
    "sauceTomate": {
      "description": "La sauce tomate, souvent composée de tomates concassées et d’aromates, vient lier tous les ingrédients. Elle ajoute une touche d’acidité équilibrée, contrebalançant le gras des viandes et rehaussant les arômes du plat.",
      "imagePath": "/Images/sauceTomate.png",
      "source": "https://www.elle.fr/Elle-a-Table/Recettes-de-cuisine/Cassoulet-2071020"
    },
    "saucisse": {
      "description": "La saucisse de Toulouse, faite de chair de porc hachée grossièrement et assaisonnée avec soin, est incontournable. Elle libère, à la cuisson, ses sucs parfumés qui parfument le cassoulet d’une note chaude et réconfortante.",
      "imagePath": "/Images/saucisse.png",
      "source": "https://www.mamysuzanne.com/nos-recettes/cassoulet-traditionnel-au-confit-de-canard-et-saucisse-de-toulouse/?srsltid=AfmBOorOLZzmYHPznQUH8r_uXh9rOQ-rzKxCNabFLguMHjgDyYHjVw8q"
    },
    "graisse": {
      "description": "Utilisée en début de préparation, la graisse de canard permet de faire revenir les viandes et les légumes. Son parfum riche et sa rondeur apportent une touche authentique qui enrichit la palette aromatique du plat.",
      "imagePath": "/Images/graisse.png",
      "source": "https://www.ina.fr/ina-eclaire-actu/laite-cassoulet-recette-rion-des-landes-cuisine"
    },
    "carotte": {
      "description": "La carotte, douce et légèrement sucrée, apporte une note de fraîcheur et de couleur au cassoulet. Elle se mêle aux autres légumes pour équilibrer les saveurs et enrichir la texture du plat.",
      "imagePath": "/Images/carotte.png",
      "source": "https://www.ptitchef.com/recettes/plat/recette-de-cassoulet-fid-595480"
    },
    "oignons": {
      "description": "Les oignons, doucement revenus, apportent une douceur et une profondeur aromatique essentielles. Ils servent de base parfumée qui relève subtilement le goût des viandes et des haricots.",
      "imagePath": "/Images/oignons.png",
      "source": "https://www.cassoulet.com/content/7-recette-officielle-du-vrai-cassoulet-de-castelnaudary"
    }
  }
  